# Parameters
nc: 80 
depth_multiple: 0.33 
width_multiple: 0.50 
anchors:
  - [10, 13, 16, 30, 33, 23] 
  - [30, 61, 62, 45, 59, 119] 
  - [116, 90, 156, 198, 373, 326] 

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], 
    [-1, 1, GhostConv, [128, 3, 2]], 
    [-1, 3, C3Ghost, [128]],
    [-1, 1, GhostConv, [256, 3, 2]], 
    [-1, 6, C3Ghost, [256]],
    [-1, 1, GhostConv, [512, 3, 2]], 
    [-1, 9, C3Ghost, [512]],
    [-1, 1, GhostConv, [1024, 3, 2]], 
    [-1, 3, C3Ghost, [1024]],
    [-1, 1, SPPF, [1024, 5]], 
  ]

head: [
    [-1, 1, GhostConv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3Ghost, [512, False]], # 13

    [-1, 1, GhostConv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3Ghost, [256, False]], # 17 (P3/8-small)

    [-1, 1, GhostConv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3Ghost, [512, False]], # 20 (P4/16-medium)

    [-1, 1, GhostConv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3Ghost, [1024, False]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
