# Parameters
nc: 80 
depth_multiple: 1.0 
width_multiple: 1.0 
anchors: 3 

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], 
    [-1, 1, Conv, [128, 3, 2]], 
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], 
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], 
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [768, 3, 2]], 
    [-1, 3, C3, [768]],
    [-1, 1, Conv, [1024, 3, 2]], 
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], 
  ]

head: [
    [-1, 1, Conv, [768, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 8], 1, Concat, [1]], 
    [-1, 3, C3, [768, False]], 

    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], 
    [-1, 3, C3, [512, False]], 

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], 
    [-1, 3, C3, [256, False]], 

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 20], 1, Concat, [1]], 
    [-1, 3, C3, [512, False]], 

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 16], 1, Concat, [1]], 
    [-1, 3, C3, [768, False]], 

    [-1, 1, Conv, [768, 3, 2]],
    [[-1, 12], 1, Concat, [1]], 
    [-1, 3, C3, [1024, False]], 

    [[23, 26, 29, 32], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5, P6)
  ]
